In [9]:
# 1.Ans.

import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [10]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
# 2. Ans.

loc is a label-based indexer, which means it uses labels or index values to select rows and columns

iloc, on the other hand, is an integer-based indexer, which means it uses integer
positions to select rows and columns.

In [13]:
# 3.Ans.

import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

new_df  = df.reindex([3,0,1,2])

In [14]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [18]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [19]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
Yes both the outputs are different. loc[2] takes the index value 2 which is Big Data.
but iloc[2] takes  an integer based indexer means it takes the index 2 which is Machine Learning.

In [21]:
# 4.Ans.

import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [22]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.517603  0.037480  0.549938  0.930578  0.076938  0.938034
2  0.763918  0.195013  0.815529  0.130837  0.371593  0.801213
3  0.708811  0.990419  0.960246  0.719366  0.420474  0.738966
4  0.244604  0.587185  0.777295  0.639648  0.271428  0.168674
5  0.969637  0.455998  0.124816  0.901110  0.987572  0.972106
6  0.429292  0.733185  0.235717  0.889696  0.781283  0.569844

In [23]:
df1.mean()

column_1    0.605644
column_2    0.499880
column_3    0.577257
column_4    0.701873
column_5    0.484881
column_6    0.698140
dtype: float64

In [31]:
df1['column_2'].std()

0.3496756851779114

In [33]:
# 5.Ans.

df1.loc[2, 'column_2'] = 'string_variable'

df1

   column_1         column_2  column_3  column_4  column_5  column_6
1  0.517603          0.03748  0.549938  0.930578  0.076938  0.938034
2  0.763918  string_variable  0.815529  0.130837  0.371593  0.801213
3  0.708811         0.990419  0.960246  0.719366  0.420474  0.738966
4  0.244604         0.587185  0.777295  0.639648  0.271428  0.168674
5  0.969637         0.455998  0.124816  0.901110  0.987572  0.972106
6  0.429292         0.733185  0.235717  0.889696  0.781283  0.569844

In [ ]:
df1['column_2'].mean() # this gives an error unsupported operand type(s) for +: 'float' and 'str'

In [ ]:
# 6.Ans.

In Pandas, the windows functions are used for performing calculations on a rolling window of data. 
These functions are designed to work on a set of values called a window, which is a fixed-size subset 
of the data. The window is then shifted across the data, and the function is applied to each window.

There are several types of window functions in Pandas, which include:

Rolling: This function creates a rolling window of a fixed-size and applies a function to it.

Expanding: This function creates a window that starts with a minimum size and expands to include more
data as it moves forward.

Exponential: This function assigns weights to data points based on their distance from the current time period.

Rolling Window Aggregations: This function computes aggregations on a rolling window, such as mean
, median, min, max, etc.

Rolling Apply: This function applies a user-defined function to each rolling window.

In [37]:
# 7.Ans.

import pandas as pd

now = pd.Timestamp.now()

current_month = now.month
current_year = now.year

print("Current Month:", current_month)
print("Current Year:", current_year)

Current Month: 3
Current Year: 2023

In [41]:
# 8.Ans.

import pandas as pd
date1_str = input("Enter the 1st date (YYYY-MM-DD):")
date2_str = input("Enter the 2nd date (YYYY-MM-DD):")

date1 = pd.Timestamp(date1_str)
date2 = pd.Timestamp(date2_str)

timedelta = date2 - date1

days = timedelta.days
hours = timedelta.seconds // 3600
minutes = (timedelta.seconds // 60) % 60

print("The difference is:")
print(f"{days} days, {hours} hours, and {minutes} minutes.")

Enter the 1st date (YYYY-MM-DD): 01-01-2002
Enter the 2nd date (YYYY-MM-DD): 19-03-2023

The difference is:
7747 days, 0 hours, and 0 minutes.

/tmp/ipykernel_77/1423927933.py:8: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  date2 = pd.Timestamp(date2_str)

In [47]:
# 9.Ans.

import pandas as pd

# Prompt user to enter file path, column name, and category order
file_path = input("Enter file path: ")
column_name = input("Enter column name to convert to categorical data type: ")
category_order = input("Enter category order (comma-separated): ").split(",")

data = pd.read_csv(file_path)

data[column_name] = pd.Categorical(data[column_name], categories=category_order, ordered=True)

sorted_data = data.sort_values(column_name)
print(sorted_data)

Enter file path:  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Enter column name to convert to categorical data type:  Sex
Enter category order (comma-separated):  male,female

     PassengerId  Survived  Pclass                                    Name  \
0              1         0       3                 Braund, Mr. Owen Harris
532          533         0       3                    Elias, Mr. Joseph Jr
536          537         0       1       Butt, Major. Archibald Willingham
538          539         0       3                Risien, Mr. Samuel Beard
543          544         1       2                       Beane, Mr. Edward
..           ...       ...     ...                                     ...
290          291         1       1            Barber, Miss. Ellen "Nellie"
651          652         1       2                     Doling, Miss. Elsie
289          290         1       3                    Connolly, Miss. Kate
166          167         1       1  Chibnall, Mrs. (Edith Martha Bowerman)
184          185         1       3     Kink-Heilmann, Miss. Luise Gretchen

        Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0      male  22.0      1      0  A/5 21171   7.2500   NaN        S
532    male  17.0      1      1       2690   7.2292   NaN        C
536    male  45.0      0      0     113050  26.5500   B38        S
538    male   NaN      0      0     364498  14.5000   NaN        S
543    male  32.0      1      0       2908  26.0000   NaN        S
..      ...   ...    ...    ...        ...      ...   ...      ...
290  female  26.0      0      0      19877  78.8500   NaN        S
651  female  18.0      0      1     231919  23.0000   NaN        S
289  female  22.0      0      0     370373   7.7500   NaN        Q
166  female   NaN      0      1     113505  55.0000   E33        S
184  female   4.0      0      2     315153  22.0250   NaN        S

[891 rows x 12 columns]

In [ ]:
# 10.Ans.

import pandas as pd
import matplotlib.pyplot as plt

file_path = input("Enter file path: ")

data = pd.read_csv(file_path)

data['Date'] = pd.to_datetime(data['Date'])

grouped_data = data.groupby(['Category', 'Date'])['Sales'].sum().unstack()

grouped_data.plot(kind='bar', stacked=True)

plt.title('Sales by Product Category over Time')
plt.xlabel('Date')
plt.ylabel('Sales')

plt.show()

In [ ]:
# 11.Ans.

import pandas as pd

file_path = input("Enter the path:")

data = pd.read_csv('')

mean_score = data['Test Score'].mean()
median_score = data['Test Score'].median()
mode_score = data['Test Score'].mode()

ans = pd.DataFrame({'Statistic': ['Mean', 'Median', 'Mode'],
                        'Test Score': [mean_score, median_score, mode_score]})
print(ans)